{
  "architectures": [
    "Qwen2MoeForCausalLM"
  ],
  "model_type": "llama",
  "bos_token_id": 1,
  "eos_token_id": 2,
  "pad_token_id": 0,
  "vocab_size": 32000,
  "hidden_size": 2048,
  "intermediate_size": 6144,
  "moe_intermediate_size": 768,
  "num_hidden_layers": 48,
  "num_attention_heads": 32,
  "num_key_value_heads": 4,
  "num_experts": 128,
  "num_experts_per_tok": 8,
  "decoder_sparse_step": 1,
  "shared_expert_intermediate_size": 0,
  "norm_topk_prob": true,
  "hidden_act": "silu",
  "rms_norm_eps": 1e-06,
  "max_position_embeddings": 4096,
  "rope_theta": 10000000,
  "rope_scaling": null,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.39.3",
  "use_cache": true
}
